readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-21 Fri 15:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Lucas Caballero" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline17">1. Introduction</a>
<ul>
<li><a href="#orgheadline1">1.1. Overview</a></li>
<li><a href="#orgheadline2">1.2. Installation</a></li>
<li><a href="#orgheadline14">1.3. Usage</a>
<ul>
<li><a href="#orgheadline3">1.3.1. IsZero(t, actual, expected)</a></li>
<li><a href="#orgheadline4">1.3.2. IsEqInt(t, actual, expected)</a></li>
<li><a href="#orgheadline5">1.3.3. GreaterThan(t, actual, expected)</a></li>
<li><a href="#orgheadline6">1.3.4. IsTrue(t, actual)</a></li>
<li><a href="#orgheadline7">1.3.5. IsFalse(t, actual)</a></li>
<li><a href="#orgheadline8">1.3.6. IsEqBytes(t, actual)</a></li>
<li><a href="#orgheadline9">1.3.7. IsEqByte(t, actual)</a></li>
<li><a href="#orgheadline10">1.3.8. IsNotNil(t, actual)</a></li>
<li><a href="#orgheadline11">1.3.9. IsNil(t, actual)</a></li>
<li><a href="#orgheadline12">1.3.10. ShouldPanic(t, fn)</a></li>
<li><a href="#orgheadline13">1.3.11. ShouldNotPanic(t, fn)</a></li>
</ul>
</li>
<li><a href="#orgheadline16">1.4. License</a>
<ul>
<li><a href="#orgheadline15">1.4.1. See license file.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>exam</code> is a small set of convenience functions designed to help
examine and assert values when writing test cases.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Installation</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-shell">go get github.com/lcaballero/exam
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">1.3</span> Usage</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.3.1</span> IsZero(t, actual, expected)</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-go">n := 0
<span style="color: #8AAFFA;">IsZero</span>(t, n)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.3.2</span> IsEqInt(t, actual, expected)</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-go">n := 1
<span style="color: #8AAFFA;">IsEqInt</span>(t, n, 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.3.3</span> GreaterThan(t, actual, expected)</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-go">n := 2
<span style="color: #8AAFFA;">GreaterThan</span>(t, n, 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.3.4</span> IsTrue(t, actual)</h4>
<div class="outline-text-4" id="text-1-3-4">
<div class="org-src-container">

<pre class="src src-go">n := 3
<span style="color: #8AAFFA;">IsTrue</span>(t, n == 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.3.5</span> IsFalse(t, actual)</h4>
<div class="outline-text-4" id="text-1-3-5">
<div class="org-src-container">

<pre class="src src-go">n := 4
<span style="color: #8AAFFA;">IsFalse</span>(t, n == 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">1.3.6</span> IsEqBytes(t, actual)</h4>
<div class="outline-text-4" id="text-1-3-6">
<div class="org-src-container">

<pre class="src src-go">a := []<span style="color: #EF5C5F;">byte</span>{ <span style="color: #A6AB04;">'a'</span>, <span style="color: #A6AB04;">'b'</span>, <span style="color: #A6AB04;">'c'</span> }
b := []<span style="color: #8AAFFA;">byte</span>(<span style="color: #A6AB04;">"abc"</span>)
<span style="color: #8AAFFA;">IsEqBytes</span>(t, a, b)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.3.7</span> IsEqByte(t, actual)</h4>
<div class="outline-text-4" id="text-1-3-7">
<div class="org-src-container">

<pre class="src src-go">a := []<span style="color: #EF5C5F;">byte</span>{ <span style="color: #A6AB04;">'a'</span>, <span style="color: #A6AB04;">'b'</span>, <span style="color: #A6AB04;">'c'</span> }
b := []<span style="color: #8AAFFA;">byte</span>(<span style="color: #A6AB04;">"abc"</span>)
<span style="color: #8AAFFA;">IsEqByte</span>(t, a[1], b[1])
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">1.3.8</span> IsNotNil(t, actual)</h4>
<div class="outline-text-4" id="text-1-3-8">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #FFB070;">type</span> <span style="color: #EF5C5F;">mystruct</span> <span style="color: #FFB070;">struct</span> {}
my := &amp;<span style="color: #EF5C5F;">mystruct</span>{}
<span style="color: #8AAFFA;">IsNotNil</span>(t, my)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.3.9</span> IsNil(t, actual)</h4>
<div class="outline-text-4" id="text-1-3-9">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #FFB070;">var</span> my *mystruct
<span style="color: #8AAFFA;">IsNil</span>(t, my)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">1.3.10</span> ShouldPanic(t, fn)</h4>
<div class="outline-text-4" id="text-1-3-10">
<div class="org-src-container">

<pre class="src src-go">willPanic := <span style="color: #FFB070;">func</span>() {
    <span style="color: #8fbfdc;">panic</span>(<span style="color: #A6AB04;">"panicking... now..."</span>)
}
<span style="color: #8AAFFA;">ShouldPanic</span>(t, willPanic)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.3.11</span> ShouldNotPanic(t, fn)</h4>
<div class="outline-text-4" id="text-1-3-11">
<div class="org-src-container">

<pre class="src src-go">dontPanic := <span style="color: #FFB070;">func</span>() {
    <span style="color: #76AB55;">// </span><span style="color: #76AB55;">panicking... now...</span>
}
<span style="color: #8AAFFA;">ShouldNotPanic</span>(t, dontPanic)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">1.4</span> License</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">1.4.1</span> See license file.</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
The use and distribution terms for this software are covered by the
<a href="http://opensource.org/licenses/eclipse-1.0.txt">EPL-1</a>, which can be found in the file 'license' at the
root of this distribution. By using this software in any fashion, you are
agreeing to be bound by the terms of this license. You must not remove this
notice, or any other, from this software.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas Caballero</p>
<p class="date">Created: 2016-10-21 Fri 15:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
